# Merge and Append Data

Goal: merge and append the data
1. pandas.merge
2. pandas.concaternate

In [1]:
import pandas as pd

In [2]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'airport': ['BOS', 'BOS', 'PDX', 'MHT', 'MHT'], 
        'city': ['Boston', 'Boston', 'AS', 'Manchester', 'Manchester']}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'airport', 'city'])
df_a

  subject_id airport        city
0          1     BOS      Boston
1          2     BOS      Boston
2          3     PDX          AS
3          4     MHT  Manchester
4          5     MHT  Manchester

In [16]:
raw_data= {
        'subject_id':[ '3', '4', '5','10'],
        'weather': ['clear', 'snow','snow','rain']
}
df_b = pd.DataFrame(raw_data,columns =[ 'subject_id', 'weather'])
df_b

  subject_id weather
0          3   clear
1          4    snow
2          5    snow
3         10    rain

## Append the two dataframes along rows

In [17]:
df_new = pd.concat([df_a, df_b])
df_new

  airport        city subject_id weather
0     BOS      Boston          1     NaN
1     BOS      Boston          2     NaN
2     PDX          AS          3     NaN
3     MHT  Manchester          4     NaN
4     MHT  Manchester          5     NaN
0     NaN         NaN          3   clear
1     NaN         NaN          4    snow
2     NaN         NaN          5    snow
3     NaN         NaN         10    rain

## Combine Data Sets
join matching rows from df_b to df_a

In [18]:
df_merge = pd.merge(df_a, df_b, how= 'left', on= 'subject_id')
df_merge

  subject_id airport        city weather
0          1     BOS      Boston     NaN
1          2     BOS      Boston     NaN
2          3     PDX          AS   clear
3          4     MHT  Manchester    snow
4          5     MHT  Manchester    snow

join mathcing rows from df_a to df_b

In [19]:
df_merge = pd.merge(df_a, df_b, how= 'right', on= 'subject_id')
df_merge

  subject_id airport        city weather
0          3     PDX          AS   clear
1          4     MHT  Manchester    snow
2          5     MHT  Manchester    snow
3         10     NaN         NaN    rain

join data. Retain only rows in both sets

In [20]:
df_merge = pd.merge(df_a, df_b, how = 'inner', on = 'subject_id')
df_merge

  subject_id airport        city weather
0          3     PDX          AS   clear
1          4     MHT  Manchester    snow
2          5     MHT  Manchester    snow

join data. retain all values, all rows.

In [23]:
df_merge = pd.merge(df_a, df_b, how = 'outer', on = 'subject_id')
df_merge

  subject_id airport        city weather
0          1     BOS      Boston     NaN
1          2     BOS      Boston     NaN
2          3     PDX          AS   clear
3          4     MHT  Manchester    snow
4          5     MHT  Manchester    snow
5         10     NaN         NaN    rain